### Assignment 7
Choose six recent popular movies. Ask at least five people that you know (friends, family, classmates, imaginary friends) to rate each of these movies that they have seen on a scale of 1 to 5. There should be at least one movie that not everyone has seen! Take the results (observations) and store them somewhere (like a SQL database, or a .CSV file). Load the information into a pandas dataframe. Your solution should include Python and pandas code that accomplishes the following:

- Load the ratings by user information that you collected into a pandas dataframe.
- Show the average ratings for each user and each movie.
- Create a new pandas dataframe, with normalized ratings for each user. Again, show the average ratings for each user and each movie.
- Provide a text-based conclusion: explain what might be advantages and disadvantages of using normalized ratings instead of the actual ratings.
- [Extra credit] Create another new pandas dataframe, with standardized ratings for each user. Once again, show the average ratings for each user and each movie.
Let's begin by importing our libs and importing our data which we can load into the dataframe.

In [27]:
import pandas as pd
import numpy as np

### We can use
data = pd.read_csv('https://github.com/GabrielSantos33/IS362_Assignment7/blob/main/test_data.csv', index_col=0, delimiter=',', error_bad_lines=False)

df1 = pd.DataFrame(data)

### Or

In [28]:
data = pd.read_csv('test_data.csv', index_col=0, delimiter=',')
df1 = pd.DataFrame(data)

In [29]:
data

,Harry Potter,Fast and Furious,Batman,The Edge of Tomorrow,Pulp Fiction,Star Wars
Joe,4.0,3.0,5.0,NaN,4.0,1.0
Jane,3.0,1.0,4.0,5.0,NaN,4.0
Jeff,4.0,2.0,4.0,4.0,4.0,NaN
Jill,2.0,5.0,NaN,2.0,2.0,3.0
Mark,NaN,5.0,4.0,3.0,4.0,5.0
Phil,5.0,NaN,2.0,4.0,1.0,1.0

In [30]:
df1

,Harry Potter,Fast and Furious,Batman,The Edge of Tomorrow,Pulp Fiction,Star Wars
Joe,4.0,3.0,5.0,NaN,4.0,1.0
Jane,3.0,1.0,4.0,5.0,NaN,4.0
Jeff,4.0,2.0,4.0,4.0,4.0,NaN
Jill,2.0,5.0,NaN,2.0,2.0,3.0
Mark,NaN,5.0,4.0,3.0,4.0,5.0
Phil,5.0,NaN,2.0,4.0,1.0,1.0

### Now that we have our data loaded in the dataframe we can go ahead get our averages. We will also want to put into a new row by using loc as you can see below. Laastly I replace the NaN's with blanks as shown in the example problem.

In [31]:
df1.loc['mean'] = df1.mean()
df1.replace(np.nan, '', regex=True)

,Harry Potter,Fast and Furious,Batman,The Edge of Tomorrow,Pulp Fiction,Star Wars
Joe,4,3,5,,4,1
Jane,3,1,4,5,,4
Jeff,4,2,4,4,4,
Jill,2,5,,2,2,3
Mark,,5,4,3,4,5
Phil,5,,2,4,1,1
mean,3.6,3.2,3.8,3.6,3,2.8

### Average rating for each user

In [32]:
df1.mean()

Harry Potter            3.6
Fast and Furious        3.2
Batman                  3.8
The Edge of Tomorrow    3.6
Pulp Fiction            3.0
Star Wars               2.8
dtype: float64

### Average rating for each movie

In [33]:
df2 = pd.Series(df1.mean(axis=1))
df2

Joe     3.400000
Jane    3.400000
Jeff    3.600000
Jill    2.800000
Mark    4.200000
Phil    2.600000
mean    3.333333
dtype: float64

### As you can see the mean is added as the last row fully calculated. Next step is to perform a normalization on the data. Shown below is the calculations i used to find the normalization of the table. Again I replace the 'NaN's with blanks.

## Data frame with normalized series

In [34]:
df_norm = (df1 - df1.min()) / (df1.max() - df1.min())
df_norm.replace(np.nan, '', regex=True)

,Harry Potter,Fast and Furious,Batman,The Edge of Tomorrow,Pulp Fiction,Star Wars
Joe,0.666667,0.5,1,,1,0
Jane,0.333333,0,0.666667,1,,0.75
Jeff,0.666667,0.25,0.666667,0.666667,1,
Jill,0,1,,0,0.333333,0.5
Mark,,1,0.666667,0.333333,1,1
Phil,1,,0,0.666667,0,0
mean,0.533333,0.55,0.6,0.533333,0.666667,0.45

### Or we can pivot transpose the information this way

In [35]:
ratings_norm = ((df1 - df1.min()) / (df1.max() - df1.min())).transpose()
ratings_norm

,Joe,Jane,Jeff,Jill,Mark,Phil,mean
Harry Potter,0.666667,0.333333,0.666667,0.000000,NaN,1.000000,0.533333
Fast and Furious,0.500000,0.000000,0.250000,1.000000,1.000000,NaN,0.550000
Batman,1.000000,0.666667,0.666667,NaN,0.666667,0.000000,0.600000
The Edge of Tomorrow,NaN,1.000000,0.666667,0.000000,0.333333,0.666667,0.533333
Pulp Fiction,1.000000,NaN,1.000000,0.333333,1.000000,0.000000,0.666667
Star Wars,0.000000,0.750000,NaN,0.500000,1.000000,0.000000,0.450000

### Average by user

In [36]:
ratings_norm.mean(axis=1)

Harry Potter            0.533333
Fast and Furious        0.550000
Batman                  0.600000
The Edge of Tomorrow    0.533333
Pulp Fiction            0.666667
Star Wars               0.450000
dtype: float64

### Average by movie

In [37]:
mov_norm = pd.Series(ratings_norm.mean())
mov_norm

Joe     0.633333
Jane    0.550000
Jeff    0.650000
Jill    0.366667
Mark    0.800000
Phil    0.333333
mean    0.555556
dtype: float64

### To conclude this data set there, have some advantages and disadvantages on using normalization. The normalized rating has advantage since a low or hugh rating by one single user won't have much of an effect. The disadvantage is the mean rating won't mean much. It may not be accurate as the non-normalized one.